In [5]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from sklearn import linear_model
# for exercise
from word2number import w2n

# price = m1.area + m2.bedrooms + m3.age + b
    price ----> dependent variable
    area, bd, age ----> independent variableS (features)
    m1,m2,m3 ----> coefficients
    b ----> intercept

In [6]:
df = pd.read_csv('homeprices.csv')
df

   area  bedrooms  age   price
0  2600       3.0   20  550000
1  3000       4.0   15  565000
2  3200       NaN   18  610000
3  3600       3.0   30  595000
4  4000       5.0    8  760000

In [7]:
import math
missing = math.floor(df.bedrooms.median()) # finding median
missing

3

In [8]:
df.bedrooms = df.bedrooms.fillna(missing) # replacing NaN with median value
df

   area  bedrooms  age   price
0  2600       3.0   20  550000
1  3000       4.0   15  565000
2  3200       3.0   18  610000
3  3600       3.0   30  595000
4  4000       5.0    8  760000

In [9]:
reg = linear_model.LinearRegression()
reg.fit(df[['area', 'bedrooms', 'age']], df.price)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [10]:
reg.coef_

array([   137.25, -26025.  ,  -6825.  ])

In [11]:
reg.intercept_

383724.9999999998

In [12]:
reg.predict([[3000,3,40]])

array([444400.])

In [13]:
137.25*3000 + -26025*3 + -6825*40 + 383724.9999999998 # equal to predicted one

444399.9999999998

In [14]:
reg.predict([[2500,4,5]])

array([588625.])

# Exercise

In [35]:
eg = pd.read_csv('hiring.csv')
eg

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [36]:
eg.experience = eg.experience.fillna('zero')
eg

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0       zero                    8.0                           9      50000
1       zero                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [37]:
eg.experience = eg.experience.apply(w2n.word_to_num)
eg

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           0                    8.0                           9      50000
1           0                    8.0                           6      45000
2           5                    6.0                           7      60000
3           2                   10.0                          10      65000
4           7                    9.0                           6      70000
5           3                    7.0                          10      62000
6          10                    NaN                           7      72000
7          11                    7.0                           8      80000

In [39]:
eg['test_score(out of 10)'] = eg['test_score(out of 10)'].fillna(eg['test_score(out of 10)'].median())
eg

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           0                    8.0                           9      50000
1           0                    8.0                           6      45000
2           5                    6.0                           7      60000
3           2                   10.0                          10      65000
4           7                    9.0                           6      70000
5           3                    7.0                          10      62000
6          10                    8.0                           7      72000
7          11                    7.0                           8      80000

In [40]:
reg = linear_model.LinearRegression()
reg.fit(eg[['experience','test_score(out of 10)','interview_score(out of 10)']],eg['salary($)'])

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [41]:
reg.predict([[2,9,6]])

array([53205.96797671])

In [42]:
reg.predict([[12,10,10]])

array([92002.18340611])